[
    {
        "title": "A Year Gone By",
        "image": "https://i.imgur.com/bQLMs8m.jpg",
        "genre": "Mental Health",
        "dateWritten": "May 5th, 2021",
        "blurb": "2020 was an insane year for everyone no doubt, here I talk about my own experiences and how I've changed as a result.",
        "paragraphs": [
            "With my birthday coming up, I decided to take a break from my long form content to ruminate on the last year and all the change that it brought to my life. A year ago, I couldn't have been less excited to turn 21. Growing a year older only served to remind me that I was stuck once again under the inescapable weight of myself, watching the time slip away. I'm sure I was not alone in feeling this way as the pandemic started to kick off. I personally remember being afraid to even leave my house, convinced that a strangers cough would have me dying on the street.",
            "It didn't help that I had just lost the partner I had build my entire adult life with as I moved away from our home. In doing so, I had to say goodbye to my DnD party, my job, and my city to moe back in with my parents. I didn't even have a license, and biking around the sprawling Springs was a far cry from what I had grown to love in Boulder. To say I felt defeated would be an understatment, it was like I had come full circle to the hell I barely escaped in High School. It seemed like I would be doomed to repeat this cycle forever.",
            "The only thing I had going for me at the time was my recent graduation from a 6 month coding bootcamp. The plan had been to use the bootcamp as a foothold out of food service while my partner finished her degree. Instead I graduated and tried to forget that it ever happened, with no motivation to code my website and find a job. It was just another expensive defeat. Watching my friends start graduating from actual Universities, I cursed myself for falling so far behind",
            "My anxiety never ceased to remind me that, at the rate I was going, I would die nameless and alone. Life was passing me up by the second and I knew it. But rather than taking it upon myself to do something about it, I turned to the best escape I knew, video games. I could sit for hours at a time in that escapist bliss, pouring my thoughts and energy into meaningless challenges the ultimately provided me nothing in return. Not even video games could distract me from the fact that I was dying of emptiness, crushed under the weight of my own shortcomings. Without someone to love, someone to put my identity in, I was no one. Just waiting to leave Limbo yet unwilling to take a step in any direction. It was then, with my only escape failing, that I finally turned to writing and running",
            "My first blog post was written towards the end of May, on the subject of police brutality. For a brief moment after writing that, I felt like I mattered, like I had something to say that was worth listening to. But I soon realized that I still had no voice of my own, and writing on the plights of others did nothing to rectify that. And because I lacked the motivation to code my website, it was ultiamtely no more than a Google Doc on social media. A start.",
            "After living at home for a bit, my mother started dragging me to the gym with her. Something about excercise and taking care of my body. I started running, and at first it provided me an escape that left my demons in the dust. But after a couple miles, those demons would start catching up and I could run no further.",
            "Neither activity granted me lasting relief, and whether writing an essay or running from myself, I could not escape the weight of my nothing. I still desperately wanted for someone to tell me who I was.",
            "The rest of 2020 came and went in a blink, and honestly, I wasted most of it. I did get my driver's license back, which returned a little freedom. But that freedom only sent me back to Boulder, where I foolishly thought I would find myself again, like I had those years before. Before September I was back to numbing my anxiety with video games and vapid love. For a time, the weight did seem to ease, but just as I cannot outrun my demons nor hide in a video game, I could not keep placing my identity in someone else. Improvement is a slow thing, to be sure.",
            "Since the pandemic began, change has been the only fixture in my life. For once though, change has been my ally. Finally, I am learning. I have learned that to fear is to solves nothing and helps no one. Now, when the voice of anxiety reminds me that the world is passing me by, I listen. My anxiety is on the same team as I am, and even if I don't agree with its methods, its right. The world is not going to wait even a second for me to get my shit together. I have learned to appreciate that anxiety, and with it I can take on the world.",
            "Though far from finished, I have finally developed a website on which to share my voice and my world. Though I am far from knowing myself, my voice grows louder every day. Drive and passion carry me to the edge, and I will learn to hone it. I am working full time again, and earning more than I ever have at something I actually enjoy. I take it upon myself to learn, reading textbooks and mastering new skills of my own volition, rather than shrinking back from the challenge. I have spent the last three months studying for the CompTIA Security+ cert, and I am taking the exam next week. I made the same goal two years ago and gave up within days.",
            "I write every single day. I can read back on that first blog post now and find amusement in my novice mistakes. I no longer write for someone else's cause, but because I have recognized that words are my craft, and with each sentence I temper my tools.",
            "I can run 5 miles without stopping for breath, and I drag my demons along for every step now. For the first time in my life, I can be alone without feeling the weight of my nothing. For the first time in my life, I am not lost seeking someone to tell me who I am.",
            "Don't get me wrong, I am still clueless as to who I am. Now I just have the courage to push myself to the edge and find out. I look back on where I've been because I know that there will always be times when I doubt the worth of living. There will no doubt come a time when I lose everything once again, and I will have far more to lose. But even in the moments of weakness, I need only look back on how far I've come. Someday, when I find myself full circle in hell, I know that so long as I do not submit to fear and compacency, starting again will only get easier.",
            "Nothing in life is the way I expected it to be. Nothing is the way I wanted it to be. I wouldn't have it any other way."
        ]

    }
]